Revit 2027 API
BuiltInFailures.GeneralFailures.InvalidOrderOfPhases Property
 Invalid order of phases: [Type Name] cannot be demolished before it was created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidOrderOfPhases { get; }
Public Shared ReadOnly Property InvalidOrderOfPhases As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidOrderOfPhases {
	FailureDefinitionId^ get ();
}
static member InvalidOrderOfPhases : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace